surfaceWater/runCases/RANS_2D/MeshSelection4/5mmX0.5mm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        nFaces          380;
        startFace       721;
    }
    bottom
    {
        type            wall;
        physicalType    wall;
        nFaces          20;
        startFace       1101;
    }
    right
    {
        type            cyclicAMI;
        neighbourPatch  left;
        transform       translational;
        separationVector    (-0.15 0 0);
        nFaces          19;
        startFace       1121;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       1140;
    }
    left
    {
        type            cyclicAMI;
        neighbourPatch  right;
        transform       translational;
        separationVector    (0.15 0 0);
        nFaces          19;
        startFace       1160;
    }
    front
    {
        type            empty;
        nFaces          380;
        startFace       1179;
    }
)

// ************************************************************************* //
